CWB_DB_PATH = '/var/sqlite/cwb.db'

TABLE_AQFN = 'table_AQI'

TABLE_AQI = 'table_AQI_now'


HUGE_GROUP_IDS = [
    'C770afed112311f3f980291e1e488e0ef'
]


TEST_GROUP_IDS = [
    'C1bebaeaf89242089f0d755d492df6cb6',
    'C498a6c669b4648d8dcb807415554fda1',
]

LINE_DB_PATH = '/var/sqlite/line.db'

TABLE_LINE_MSG_COUNT = 'msg_count'
TABLE_LINE_CMD_COUNT = 'cmd_count'

TEACHER_HO = [
    '{name}先生，我有錄起來喔！',
    '我婆受因果業所困，身陷卡池，御主{name}發願，願獻我薪水，求彩光乍現',
    '不要停下來，繼續抽！很好，{name}你婆要出來了！',
    '{name}我跟你講，繼續抽下去，不要理會旁邊的聲音',
    '{name}你看到那個課金的按鈕了嗎？那是慈孤的化身，你一直按，慈孤觀音就會引導你得到你想要的東西。',
    '{name}橋下那些是歐洲人，他們正在被自己的業火焚燒，不要去管他們',
    '好，{name}你聽我說，你先把信用卡準備好，你家有沒有網路？有？好，那在手機前就可以了，叫卡池聽話，照我的話做，一定抽的到',
    '{name}你不要緊張，繼續抽就對了，啊有問題再打給我喔我都在！\n\n\n嘟嘟嘟嘟嘟嘟嘟嘟',
    '很好，你課下去了。你看到什麼？卡池？那是你的本命池。想見到老婆，要先內觀自己，順從你的慾望，抽下去。',
    '{name}喔，是，我知道、我知道\n這個喔，我跟你說～你不用緊張，抽五星急不得\n這個卡池本來就是歐洲一單、非洲十單抽到\n你要對營運有信心\n你要有耐心啊，不要去SKIP他、讓他慢慢跑\n不要連點他，好嗎？\n好，你有問題再來問，我都在，我一定幫忙！',
]


SINOALICE_NIER_ID_LIST = [
    '四姊 963028424',
    '頓頓 208404895',
    'stCarP 329543491',
    '夜貓先生 832644419',
    '撇撇 121381885',
    '楓楓 694730233',
    '西門(愛睏狼) 403332013',
    '10(Lan Shawn) 372629712',
    '火腿通粉(肉凱) 589363711',
    '肉肉 220242535',
    'redyee 866447142',
    'ひまわり(小葵) 906443893',
    '群草(Bosco) 820394786',
    '微風輕語(微笑) 519184032',
    '我才不告訴你累(陳俊傑) 494857518',
    '群青(盼盼) 243719941',
    '獄剎(呂立升) 284290895',
    '\名字/ 807235479',
    '冬瓜拿鐵 469089830',
    'ハツキ 844936402',
    '多多綠少了多多(米卡狗) 376103475',
    '丸子u(采薇丸) 295185564',
    '莉芙溫 467287876'
]
